{
  "appName": "Tiny Articles",
  "appDesc": "Your daily dose of knowledge",
  "appLink": "Demo link",
  "articles": [
    {
      "id": 1,
      "headline": "How to Get Robux for Your Roblox Account?",
      "subHeadline": "Robux is the in-game currency you use to buy items and upgrades in the popular online gaming platform Roblox.",
      "heroImg": "https://picsum.photos/1280/800?random=1",
      "authorAvatar": "https://i.pravatar.cc/120",
      "authorName": "Molecule Man",
      "date": "25 January 2023",
      "category": "Gaming",
      "views": "100k",
      "likes": 44,
      "articleBody": "&lt;body&gt;&lt;h2&gt;How to Get Robux for Your Roblox Account&lt;/h2&gt;&lt;p&gt;Would you like to learn how to get Robux for your Roblox account? Robux is the in-game currency you use to buy items and upgrades in the popular online gaming platform Roblox. You don&apos;t need Robux to play Roblox, but you can use Robux to make in-game purchases, play pay-to-play games, and purchase clothing and accessories for your avatar.&lt;/p&gt;&lt;p&gt;While there is no way to get Robux for free, you can purchase Robux individually, or through a premium subscription. You can also earn Robux by making clothing and accessories for Roblox avatars or by making making pay-to-play games or games with in-game purchases. This wikiHow article teaches you how to get Robux for your Roblox account.&lt;/p&gt;&lt;h2&gt;Things You Should Know&lt;/h2&gt;&lt;ul&gt;&lt;li&gt;You can purchase Robux or you can earn Robux by creating games and items.&lt;/li&gt;&lt;li&gt;Signing up for a premium account allows you to earn Robux every month and trade items with other players.&lt;/li&gt;&lt;li&gt;Be wary of anybody claiming to give away Robux for free or Robux for referring people. It is most likely a scam.&lt;/li&gt;&lt;/ul&gt;&lt;img src=&quot;https://thumbs.dreamstime.com/b/london-uk-march-person-holding-smartphone-roblox-game-logo-london-uk-march-person-holding-smartphone-roblox-game-213199646.jpg&quot;/&gt;&lt;h3&gt;Buying Robux&lt;/h3&gt;&lt;p&gt;Open the Roblox website. Go to https://www.roblox.com/home in your browser. If you&apos;re logged into Roblox, doing so will open the Home page. If you aren&apos;t logged into Roblox, click Log In in the upper-right corner. Then enter the username and password associated with your Roblox account and click Log In.&lt;/p&gt;&lt;h3&gt;Click a Robux package deal.&lt;/h3&gt;&lt;p&gt;Click the number of Robux you want to buy. Prices range from $4.99 for 400 Robux, up to $199.99 for 22,500 Robux.&lt;/p&gt;&lt;p&gt;Tip: If you&apos;re a Premium member, you&apos;ll receive more Robux per price tier than if you just buy them independently. Click one of the green buttons on the right to purchase a subscription plan.&lt;/p&gt;&lt;h3&gt;Select a payment method&lt;/h3&gt;&lt;p&gt;Click one of the options on the right to select a payment method. The options are as follows: Credit Card — Click this option to pay with a credit card. Debit Card — Click this option to pay with a debit card. Paypal — Click this option to pay with a PayPal account. Redeem Roblox Card — Select this option if you have a Roblox gift card purchased from a retail store. Other — This option displays other payment options, including Amazon Pay, SafePay Card, CVS Pharmacy, or Ethereum&lt;/p&gt;&lt;h3&gt;Enter your payment details.&lt;/h3&gt;&lt;p&gt;Use one of the following options to enter your payment information: Credit or Debit card — If you are using a credit or debit card, you will need to enter an email address. Then enter the card number, expiration date, CVV/CVC number on the back, the name on the card, and the zip code. PayPal — If you selected PayPal, sign in with the email address and password associated with your PayPal account. Redeem Roblox Card — If you have purchased a Roblox card, scratch the back to reveal the 10 or 12 PIN on the back. Enter the PIN and click Redeem.&lt;/p&gt;&lt;h2&gt;Market your skills as a developer&lt;/h2&gt;&lt;p&gt;Creating a Roblox game takes a lot of time and effort and requires a lot of skills. Most people don&apos;t develop games on their own. One way to earn some Robux is to market your skills as a developer and help other people make games. You&apos;ll need to pick a trade and create a portfolio. Then you can market yourself on social media, web forums, Discord, or in other Roblox games. The following are some trades you can develop and market:&lt;/p&gt;&lt;b&gt;Scripting&lt;/b&gt;&lt;p&gt;Scripting is one of the most important jobs when developing a game. It&apos;s also one of the highest-paying jobs. If you are talented at scripting, you may be able to earn some Robux by scripting for Robux games.&lt;/p&gt;&lt;b&gt;Building&lt;/b&gt;&lt;p&gt;Another thing you can do to earn Robux is to develop your building skills and make things for Roblox games. This could be anything, including buildings, weapons, or vehicles. While you can build things inside Roblox Studio, many builders are utilizing external 3D modeling software, such as Blender 3D to create things. So if you have skills as a 3D modeler, you may be able to earn some Robux building objects and worlds for games.&lt;/p&gt;&lt;b&gt;Graphics Design&lt;/b&gt;&lt;p&gt;Graphic designers create image graphics. They use graphic design programs like Photoshop and Illustrator to create icons, and game thumbnail images. Sometimes they create the HUD or user interface for a game.&lt;/p&gt;&lt;b&gt;Animation&lt;/b&gt;&lt;p&gt;Animators use their skills to create animations for objects, non-player characters, and avatars. This is a little different skill from 3D modeling. If you have experience animating, you may be able to make some Robux creating animations for games.&lt;/p&gt;&lt;/body&gt;",
      "adsImg": "https://iili.io/H1hYqhP.png",
      "adslink": "https://www.google.com/"
    },
    {
      "id": 2,
      "headline": "Why Musk denounced Bitcoin?",
      "subHeadline": "The value of Bitcoin crashed recently after Elon Musk made a very public announcement regarding the cryptocurrency.",
      "heroImg": "https://picsum.photos/1280/800?random=2",
      "authorAvatar": "https://i.pravatar.cc/120",
      "authorName": "Molecule Man",
      "date": "24 January 2023",
      "category": "Business",
      "views": "500k",
      "likes": 444,
      "articleBody": "You can paste your entire post in here, and yes it can get really really long.",
      "adsImg": "https://iili.io/H1hYqhP.png",
      "adslink": "https://www.google.com/"
    },
    {
      "id": 3,
      "headline": "Is Yes Bank in trouble? Again??",
      "subHeadline": "The Story when a bank needs money, it has a few options on the table.",
      "heroImg": "https://picsum.photos/1280/800?random=3",
      "authorAvatar": "https://i.pravatar.cc/120",
      "authorName": "Molecule Man",
      "date": "Oct 31, 2022",
      "category": "Business",
      "views": "100k",
      "likes": 44,
      "articleBody": "You can paste your entire post in here, and yes it can get really really long.",
      "adsImg": "https://iili.io/H1hYfTB.png",
      "adslink": "https://www.google.com/"
    },
    {
      "id": 4,
      "headline": "Why did Amazon buy MGM Studios?",
      "subHeadline": "And Amazon can buy almost anything it wants — Which is why it should come as no surprise that they just went ahead and bought MGM",
      "heroImg": "https://picsum.photos/1280/800?random=4",
      "authorAvatar": "https://i.pravatar.cc/120",
      "authorName": "Molecule Man",
      "date": "31 May 2021",
      "category": "Business",
      "views": "100k",
      "likes": 44,
      "articleBody": "You can paste your entire post in here, and yes it can get really really long.",
      "adsImg": "https://iili.io/H1hYqhP.png",
      "adslink": "https://www.google.com/"
    },
    {
      "id": 5,
      "headline": "Does your fund manager have skin in the game?",
      "subHeadline": "SEBI introduced a new rule. mutual fund companies to invest about 20% of their salary in the schemes they run or oversee.",
      "heroImg": "https://picsum.photos/1280/800?random=5",
      "authorAvatar": "https://i.pravatar.cc/120",
      "authorName": "Molecule Man",
      "date": "11 May 2021",
      "category": "Capital Markets",
      "views": "100k",
      "likes": 44,
      "articleBody": "You can paste your entire post in here, and yes it can get really really long.",
      "adsImg": "https://iili.io/H1hYBQ1.png",
      "adslink": "https://www.google.com/"
    }
  ]
}
